nc: 1 # human
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]    # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11: cat backbone P4
  - [-1, 3, C2f, [512]]       # 12
  - [-1, 1, CBAM, [512]]      # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15: cat backbone P3
  - [-1, 3, C2f, [256]]       # 16 (P3/8-small)
  - [-1, 1, CBAM, [256]]      # 17 <<<<<<< CBAM ĐẶT Ở ĐÂY

  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 13], 1, Concat, [1]] # 19: cat head P4 (chú ý index từ lớp 13)
  - [-1, 3, C2f, [512]]       # 20 (P4/16-medium)
  - [-1, 1, CBAM, [512]]      # 21 <<<<<<< CBAM ĐẶT Ở ĐÂY

  - [-1, 1, Conv, [512, 3, 2]] # 22
  - [[-1, 9], 1, Concat, [1]] # 23: cat head P5
  - [-1, 3, C2f, [1024]]      # 24 (P5/32-large)
  # Lớp C2f cuối cùng có thể không cần CBAM để giữ nguyên đặc trưng cho Detect

  # Lớp Detect sẽ lấy đầu ra từ các nhánh đã qua CBAM và nhánh cuối cùng
  - [[17, 21, 24], 1, Detect, [nc]] # Detect(P3, P4, P5)